app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "publishedDate", "author_", "price_", "publishedDate_") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = $1, "author" = $2 WHERE "books"."id" = $3  [["updated_at", "2023-01-30 21:57:05.450910"], ["author", ""], ["id", 6]]